src/InformationRegisters/ОповещениеССервера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ОповещениеССервера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипОповещенияССервера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОповещенийССервера</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрыОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ОбработкаОповещенийССервераСервер/Ext/Module.bsl
//
//
Функция ПолучитьСообщенияССервера() Экспорт		
	
	Результат = Новый Массив;	
	
	НаборЗаписейОповещениеССервера = РегистрыСведений.ОповещениеССервера.СоздатьНаборЗаписей();
	НаборЗаписейОповещениеССервера.Прочитать();	
	
	Для Каждого ТекущаяСтрокаНаборЗаписейОповещениеССервера Из НаборЗаписейОповещениеССервера Цикл
		
		Результат.Добавить(Новый Структура("Сообщение, ТипОповещенияССервера, ПараметрыОбработки", ТекущаяСтрокаНаборЗаписейОповещениеССервера.Сообщение, ТекущаяСтрокаНаборЗаписейОповещениеССервера.ТипОповещенияССервера, ТекущаяСтрокаНаборЗаписейОповещениеССервера.ПараметрыОбработки.Получить()));
		
	КонецЦикла;
		
	Для Каждого ТекущаяСтрокаРезультат Из Результат Цикл
		
		НаборЗаписейОповещениеССервера.Отбор.Сообщение.Установить(ТекущаяСтрокаРезультат.Сообщение);
		НаборЗаписейОповещениеССервера.Прочитать();
		НаборЗаписейОповещениеССервера.Очистить();
		НаборЗаписейОповещениеССервера.Записать(Истина);
		
	КонецЦикла;
	
	Возврат Результат;	
КонецФункции

//
//
Функция ОтправитьСообщениеССервера(ТипОповещенияССервера, ПараметрыОбработки) Экспорт
	
	Результат = Истина;
	
	//Если НЕ ОбщегоНазначенияСервер.ИнформационнаяБазаФайловая() Тогда
		
		Сообщение = Новый УникальныйИдентификатор;
		НаборЗаписейОповещениеССервера = РегистрыСведений.ОповещениеССервера.СоздатьНаборЗаписей();
		НаборЗаписейОповещениеССервера.Отбор.Сообщение.Установить(Сообщение);
		
		НоваяЗапись = НаборЗаписейОповещениеССервера.Добавить();
		НоваяЗапись.Сообщение = Сообщение;
		НоваяЗапись.ТипОповещенияССервера = ТипОповещенияССервера;
		НоваяЗапись.ПараметрыОбработки = Новый ХранилищеЗначения(ПараметрыОбработки, Новый СжатиеДанных(9));
		
		НаборЗаписейОповещениеССервера.Записать();
		
	//КонецЕсли;
	
	Возврат Результат;
КонецФункции
